;					 Лабораторна робота #1
; ==========================================================================================
;     Програмування таймера Т/С0 на період часу 0,05 мс при частоті 12 МГц
; ------------------------------------------------------------------------------------------

		ORG	0000h			; Адреса старту програми
		LJMP	INIT			; Перехід на початок процедури ініціалізації

; -- Таблиця векторів переривань -----------------------------------------------------------

		ORG	000Bh			; Адреса вектора переривання по Т/С0
		LJMP	INTTC0		; Перехід на обробку переривання по Т/С0

; -- Ініціалізація мікроконтролера ---------------------------------------------------------

		ORG	0030h			; Адреса початку процедури ініціалізації
INIT:		CLR	EA			; Заборона всіх переривань
		MOV	SP,	#070h		; Встановлення дна стека

; __ Ініціалізація таймерів ___

		MOV	TMOD,	#00000010b	; Встановлюємо другий режим для таймера Т/С0
		MOV	TH0,	#0CEh		; Встановлюємо переривання 0,05 мс для таймера Т/С0
		MOV	TL0,	#0CEh		; Встановлюємо переривання 0,05 мс для таймера Т/С0
		MOV	TCON,	#00010000b	; Вмикаємо таймер Т/С0

; __ Ініціалізація переривань _

		MOV	IE,	#00000010b	; Дозвіл потрібних переривань

; ------------------------------------------------------------------------------------------

		SETB	EA
		LJMP	MAIN			; Перехід на головну програму

; ******************************************************************************************
; -- Головна програма ----------------------------------------------------------------------

MAIN:		LJMP	MAIN			; Очікуємо переривання 

; -- Підпрограма обробки переривань --------------------------------------------------------

INTTC0:	INC	P1			; Виконуємо інкремент порту Р1
		RETI				; Вихід з програми обробки переривань

; ------------------------------------------------------------------------------------------
		END				; Кінець трансляції програми
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~