;================================ Ініціалізація мікроконтролера ============================

		ORG	000h
		LJMP	INIT				; Перехід на початок ініціалізації

;--------------------------------- Таблиця векторів переривань -----------------------------

		ORG	00Bh
		LJMP	IntTC0			; Перехід на обробку переривань Т/С0

;---------------------------------- Процедура ініціалізації --------------------------------

		ORG	030h
INIT:		MOV	SP,		#070h		; Встановлення дна стеку

;______ Налаштування таймерів ____________
		
		MOV	TMOD,		#00000001b	; Встановлюємо перший режим для таймера Т/С0
		MOV	TH0,		#DTH		; Встановлення часу 60 мс у таймері T/C0
		MOV	TL0,		#DTL		; Встановлення часу 60 мс у таймері T/C0
		MOV	TCON,		#00010000b	; Вмикаємо таймер Т/С0

;_____ Налаштування переривань ___________

		MOV	IE,		#00000010b	; Дозвіл потрібних переривань
		MOV	IP,		#00000000b	; Встановлення пріоритетів переривань

;______ Налаштування змінних _____________

		MOV	P1,		#000h		; Очищення порту Р1
		MOV	P3,		#000h		; Очищення порту Р3
		MOV	VTIM,		#006		; Налаштування віртуального таймера на 0,36 с	
		MOV	HEAD,		#001		; Очищення змінної для роботи з портом Р3
		MOV	TAIL,		#128		; Очищення змінної для роботи з портом Р1
		SETB	FPART				; Визначаємо рух з голови 
		CLR	FMOVE				; Режим руху встановлюємо в появлення/зникнення
		SETB	FMODE				; Режим руху встановлюємо в появлення
		CLR	FPORT				; Встановлюємо початок з порту P1

;-------------------------------------------------------------------------------------------

		SETB	EA				; Дозвіл роботи системи переривань
		LJMP	MAIN				; Перехід до головної програми

;*******************************************************************************************