
/*		ШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШ
		ШШШШШШШ   Лабораторна робота №2 - Програмування "черв'ячка"   ШШШШШШШШ
		ШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШ
*/
;---------------------------------- Програмні константи ------------------------------------

	DTH	EQU	015h	; Параметри налаштування таймера для часу 60 мс
	DTL	EQU	0A0h	; на частоті мікроконтролера 12 МГц.
	
;----------------------------------- Програмні змінні --------------------------------------

	VTIM	EQU	030h	; Встановлення лічильника віртуального таймера
	HEAD	EQU	031h	; Змінна для відображення голови черв'ячка
	TAIL	EQU	032h	; Змінна для відображення хвоста черв'ячка
	FPART	EQU	000h	; Флаг рухомої частини (0 - голова, 1 - хвіст)
	FMOVE	EQU	001h	; режим стадії руху (0 - появлення/зникнення черв'ячка, 1 - рух черв'ячка)
	FMODE	EQU	002h	; режим стадії руху (0 - зникнення, 1 - появлення черв'ячка)
	FPORT	EQU	003h	; флаг запису в порти (0 - порт P1, 1 - порт P3)
				
;------------------------------- Додаткові файли проекту -----------------------------------	
   $Include (Init.asm)
   $Include	(ITC0.asm)

;=================================== ГОЛОВНА ПРОГРАМА ======================================

MAIN:	LJMP	MAIN		; Очікування переривань

;-------------------------------------------------------------------------------------------
		END
;===========================================================================================
